Задача:
Для онлайн-конференции необходимо написать программу, которая будет подсчитывать общую стоимость билетов. Программа должна работать следующим образом:

1. В начале у пользователя запрашивается количество билетов, которые он хочет приобрести на мероприятие.

2. Далее для каждого билета запрашивается возраст посетителя, в соответствии со значением которого выбирается стоимость:

Если посетителю конференции менее 18 лет, то он проходит на конференцию бесплатно.
От 18 до 25 лет — 990 руб.
От 25 лет — полная стоимость 1390 руб.
3. В результате программы выводится сумма к оплате. При этом, если человек регистрирует больше трёх человек на конференцию, то дополнительно получает 10% скидку на полную стоимость заказа.
Решение:
bil=int(input("Сколько билетов хотите приобрести?"))
sum_price=0
for i in range(1,bil+1):
    vozr=int(input("Сколько лет посетителю?"))
    if vozr<18:
        sum_price +=0
    elif 18<=vozr<=25:
        sum_price +=990
    else:
        sum_price +=1390
if bil>3:
    print(sum_price*0.9)
else:
    print(sum_price)
